---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StructuralAttachmentEndType
source: html/79f2d4c0-afb9-316c-44ac-afb82ec66e05.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StructuralAttachmentEndType Property

"End Attachment Type"

## Syntax (C#)
```csharp
public static ForgeTypeId StructuralAttachmentEndType { get; }
```